# DataFrame Merging

Merge DataFrame or named Series objects with a database-style join.

In [1]:
import pandas as pd

In [3]:
#Create DataFrame
student_data = {'student_id':['1','2','3','4'],'name':['Meet Vansjaliya','Abhijit Tripathy','Mit Vansjaliya','Ram Venkat']}

dataframe_students = pd.DataFrame(student_data,columns=['student_id','name'])

In [4]:
dataframe_students

  student_id              name
0          1   Meet Vansjaliya
1          2  Abhijit Tripathy
2          3    Mit Vansjaliya
3          4        Ram Venkat

In [8]:
#Create DataFrame
marks_data = {'student_id':['3','4','5','6'],'total_marks':[248,300,302,295]}

dataframe_marks = pd.DataFrame(marks_data,columns=['student_id','total_marks'])

In [9]:
dataframe_marks

  student_id  total_marks
0          3          248
1          4          300
2          5          302
3          6          295

In [11]:
# inner join
pd.merge(dataframe_students,dataframe_marks,on='student_id',how='inner')

  student_id            name  total_marks
0          3  Mit Vansjaliya          248
1          4      Ram Venkat          300

In [12]:
# outer join
pd.merge(dataframe_students,dataframe_marks,on='student_id',how='outer')

  student_id              name  total_marks
0          1   Meet Vansjaliya          NaN
1          2  Abhijit Tripathy          NaN
2          3    Mit Vansjaliya        248.0
3          4        Ram Venkat        300.0
4          5               NaN        302.0
5          6               NaN        295.0

In [13]:
# Left join
pd.merge(dataframe_students,dataframe_marks,on='student_id',how='left')

  student_id              name  total_marks
0          1   Meet Vansjaliya          NaN
1          2  Abhijit Tripathy          NaN
2          3    Mit Vansjaliya        248.0
3          4        Ram Venkat        300.0

In [14]:
# Right join
pd.merge(dataframe_students,dataframe_marks,on='student_id',how='right')

  student_id            name  total_marks
0          3  Mit Vansjaliya          248
1          4      Ram Venkat          300
2          5             NaN          302
3          6             NaN          295